Autodesk.Revit.DB.LabelUtils.GetStructuralSectionShapeName(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape)
Gets the user-visible name for a StructuralSectionShape.
shape:
The StructuralSectionShape to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Analysis.gbXMLBuildingType,Autodesk.Revit.DB.Document)
Gets the user-visible name for a gbXMLBuildingType.
Remarks:
The name is obtained in the current Revit language.
buildingType:
The gbXMLBuildingType to get the user-visible name.
document:
The document from which to get the gbXMLBuildingType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gXMLBuildingType is not available in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.UnitSymbolType)
Gets the user-visible name for a UnitSymbolType.
Remarks:
The name is obtained in the current Revit language.
unitSymbolType:
The UnitSymbolType to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
UnitSymbolType cannot be None.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.UnitType)
Gets the user-visible name for a UnitType.
Remarks:
The name is obtained in the current Revit language.
unitType:
The UnitType to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find UnitTypeInfo for the UnitType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.DisplayUnitType)
Gets the user-visible name for a DisplayUnitType.
Remarks:
The name is obtained in the current Revit language.
displayUnitType:
The DisplayUnitType to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find DisplayUnitTypeInfo for the DisplayUnitType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Plumbing.PipeFlowState,Autodesk.Revit.DB.Document)
Gets the user-visible name for a PipeFlowState.
pipeFlowState:  The PipeFlowState to get the user-visible name.
doc:  The document from which to get the PipeFlowState.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when information for the input PipeFlowState cannot be found.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Plumbing.PipeLossMethodType,Autodesk.Revit.DB.Document)
Gets the user-visible name for a PipeLossMethodType.
pipeLossMethodType:  The PipeLossMethodType to get the user-visible name.
doc:  The document from which to get the PipeLossMethodType.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when information for the input PipeLossMethodType cannot be found.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Mechanical.DuctLossMethodType,Autodesk.Revit.DB.Document)
Gets the user-visible name for a DuctLossMethodType.
ductLossMethodType:  The DuctLossMethodType to get the user-visible name.
doc:  The document from which to get the DuctLossMethodType.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when information for the input DuctLossMethodType cannot be found.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.BuiltInParameterGroup)
Gets the user-visible name for a BuiltInParameterGroup.
builtInParamGroup:  The BuiltInParameterGroup to get the user-visible name.
Remarks:  The name is obtained in the current Revit language.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.ParameterType)
Gets the user-visible name for a ParameterType.
paramType:  The ParameterType to get the user-visible name.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when failed to get user-visible name for the input ParameterType.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.BuiltInParameter)
Gets the user-visible name for a BuiltInParameter.
builtInParam:  The BuiltInParameter to get the user-visible name.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the BuiltInParameter cannot be found.

Autodesk.Revit.DB.LabelUtils
Used to obtain user-visible names for enums.
Since:
2011